DataProcessors/РабочееМестоКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоКассира</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РабочееМестоКассира/Forms/Форма/Ext/Form/Module.bsl
// =================================================================================
// МОДУЛЬ ФОРМЫ: РАБОЧЕЕ МЕСТО КАССИРА (РМК)
// Адаптация: Public_Trade_Module (Ukraine Edition)
// =================================================================================

&НаКлиенте
Перем ИмяКнопкиПоследнегоНажатия;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
// 1. Инициализация и Проверка смены (Изменено)
	Если Не ПроверитьИПодключитьСмену() Тогда
		// Не блокируем открытие, а планируем вопрос пользователю
		ПодключитьОбработчикОжидания("ПредложитьОткрытьСмену", 0.1, Истина);
	КонецЕсли;
	
	
	// 2. Стандартная инициализация
	НомерСтраницыПараметр = 1;
	ИнициализацияНастроекПанели();
	СоздатьГруппыРядов();
	ОбработчикУправлениеПанелиТоваров("ПриОткрытии");
	РежимОтображенияПанели();
	АктивироватьПоиск();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Очистка не требуется, платформа удалит элементы автоматически.
	// Строку УдалитьГруппыРядов(); удаляем.
КонецПроцедуры
&НаКлиенте
Процедура ПредложитьОткрытьСмену()
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаОткрытиеСмены", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Кассовая смена не открыта. Открыть новую смену?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаОткрытиеСмены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если СоздатьИПодключитьСменуНаСервере() Тогда
			ПоказатьПредупреждение(, "Смена успешно открыта!");
			// Обновляем заголовок или интерфейс если нужно
		Иначе
			// Ошибка при создании - закрываемся
			Закрыть();
		КонецЕсли;
	Иначе
		// Пользователь отказался - закрываем РМК
		Закрыть();
	КонецЕсли;
	
	АктивироватьПоиск();

КонецПроцедуры

#КонецОбласти

#Область ЛогикаКассовойСмены

&НаСервере
Функция ПроверитьИПодключитьСмену()
	
	// Ищем открытую смену
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассоваяСмена.Ссылка КАК Смена,
		|	КассоваяСмена.Касса КАК Касса
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ
		// ИСПРАВЛЕНО: Ссылка на правильное перечисление СтатусыКассовойСмены
		|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
		|	И НЕ КассоваяСмена.ПометкаУдаления";
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Объект.КассоваяСмена = Выборка.Смена;
	Объект.Касса = Выборка.Касса;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СоздатьИПодключитьСменуНаСервере()
	
	// 1. Определяем кассу для новой смены
	// В реальном проекте: брали бы из настроек пользователя.
	// Здесь берем первую попавшуюся или основную.
	КассаДляСмены = Справочники.Кассы.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Кассы ГДЕ НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассаДляСмены = Выборка.Ссылка;
	КонецЕсли;
	
	Если КассаДляСмены.Пустая() Тогда
		Сообщить("Ошибка: В системе нет ни одной кассы!");
		Возврат Ложь;
	КонецЕсли;
	
	// 2. Создаем документ
	Попытка
		НоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяСмена.Дата = ТекущаяДата();
		НоваяСмена.ДатаНачала = ТекущаяДата();
		НоваяСмена.Касса = КассаДляСмены; // Используем правильное имя реквизита
		НоваяСмена.Статус = Перечисления.СтатусыКассовойСмены.Открыта;
		
		НоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
		
		// 3. Подключаем к контексту формы
		Объект.КассоваяСмена = НоваяСмена.Ссылка;
		Объект.Касса = КассаДляСмены;
		
		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось открыть смену: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции
#КонецОбласти

#Область СканированиеИПоиск

&НаКлиенте
Процедура АктивироватьПоиск(Команда = Неопределено)
	Если Элементы.Найти("ПолеПоискаТовара") <> Неопределено Тогда
		ТекущийЭлемент = Элементы.ПолеПоискаТовара;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовараПриИзменении(Элемент)
	ОбработкаШтрихкода(Объект.ПолеПоискаТовара);
	Объект.ПолеПоискаТовара = ""; 
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовара2ПриИзменении(Элемент)
	ОбработкаШтрихкода(Объект.ПолеПоискаТовара2);
	Объект.ПолеПоискаТовара2 = "";
	АктивироватьПоиск();
КонецПроцедуры

// --- ГЛОБАЛЬНЫЙ ПОИСК + АКЦИЗ ---

&НаКлиенте
Процедура ОбработкаШтрихкода(Штрихкод)
	Если ПустаяСтрока(Штрихкод) Тогда Возврат; КонецЕсли;
	
	// 1. Вызываем глобальный поиск (через Client wrapper)
	Оповещение = Новый ОписаниеОповещения("ОбработкаПоискаЗавершение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.НайтиИОбработатьТовар(Штрихкод, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПоискаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		// 2. Проверяем, нужен ли акциз
		ПараметрыТовара = ПолучитьПараметрыТовараНаСервере(Результат);
		
		Если ПараметрыТовара.ТребуетАкцизнуюМарку Тогда
			// Запрашиваем ввод марки
			ОповещениеМарки = Новый ОписаниеОповещения("ВводМаркиЗавершение", ЭтотОбъект, Результат);
			ПоказатьВводСтроки(ОповещениеМарки, "", "Введите акцизную марку (Украина):", 0, Ложь);
		Иначе
			// Обычный товар
			ДобавитьТоварВЧек(Результат, "");
		КонецЕсли;
		
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМаркиЗавершение(Марка, Номенклатура) Экспорт
	
	Если Марка = Неопределено ИЛИ ПустаяСтрока(Марка) Тогда
		ПоказатьПредупреждение(, "Отмена: Акцизная марка обязательна!");
		Возврат;
	КонецЕсли;
	
	// Здесь можно добавить Regex проверку формата марки (буквы/цифры)
	ДобавитьТоварВЧек(Номенклатура, Марка);
	АктивироватьПоиск();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыТовараНаСервере(Номенклатура)
	Возврат Новый Структура("ТребуетАкцизнуюМарку", Номенклатура.ТребуетАкцизнуюМарку);
КонецФункции

&НаСервере
Процедура ДобавитьТоварВЧек(Номенклатура, АкцизнаяМарка)
	
	// Проверяем наличие строки
	ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
	
	// Если есть марка - ищем строку именно с этой маркой (уникальность)
	Если ЗначениеЗаполнено(АкцизнаяМарка) Тогда
		ПараметрыОтбора.Вставить("АкцизнаяМарка", АкцизнаяМарка);
	КонецЕсли;
	
	НайденныеСтроки = Объект.ТЧ.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		// Увеличиваем количество (для акциза это редкость, но допустим)
		СтрокаТЧ = НайденныеСтроки[0];
		СтрокаТЧ.Количество = СтрокаТЧ.Количество + 1;
	Иначе
		// Новая строка
		СтрокаТЧ = Объект.ТЧ.Добавить();
		СтрокаТЧ.Номенклатура = Номенклатура;
		СтрокаТЧ.Количество = 1;
		СтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(Номенклатура);
		СтрокаТЧ.АкцизнаяМарка = АкцизнаяМарка; 
	КонецЕсли;
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ЕСТЬNULL(Ц.Цена, 0) КАК Цена 
		|ИЗ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Д, Номенклатура=&Н) КАК Ц";
	Запрос.УстановитьПараметр("Д", ТекущаяДата());
	Запрос.УстановитьПараметр("Н", Номенклатура);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда Возврат Выб.Цена; КонецЕсли;
	Возврат 0;
КонецФункции

#КонецОбласти

#Область ДействияСТаблицейТоваров

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;
		РассчитатьИтоги();
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоги()
	// Если нужно обновлять подвалы или общую сумму формы
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если Объект.ТЧ.Количество() = 0 Тогда Возврат; КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("УдалитьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Очистить чек полностью?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТЧ.Очистить();
		РассчитатьИтоги();
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

#КонецОбласти

#Область ОформлениеПродажи

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Объект.ТЧ.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Чек пуст!");
		Возврат;
	КонецЕсли;
	
	// Выбор вида оплаты (Нал/Карта)
	СписокОплат = Новый СписокЗначений;
	СписокОплат.Добавить(PredefinedValue("Перечисление.ВидыОплаты.Наличные"), "Наличные");
	СписокОплат.Добавить(PredefinedValue("Перечисление.ВидыОплаты.Безналичные"), "Банковская карта");
	
	Оп = Новый ОписаниеОповещения("ВыборОплатыЗавершение", ЭтотОбъект);
	СписокОплат.ПоказатьВыборЭлемента(Оп, "Выберите способ оплаты:");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОплатыЗавершение(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	ВидОплаты = ВыбранныйЭлемент.Значение;
	
	// Вызов сервера для проведения
	Если ОформитьЧекНаСервере(ВидОплаты) Тогда
		ПоказатьПредупреждение(, "Чек успешно пробит!");
		Объект.ТЧ.Очистить();
		РассчитатьИтоги();
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаСервере
Функция ОформитьЧекНаСервере(ВидОплаты)
	
	Попытка
		НовыйЧек = Документы.ЧекККМ.СоздатьДокумент();
		НовыйЧек.Дата = ТекущаяДата();
		
		// Заполняем шапку из контекста формы
		НовыйЧек.Склад = Константы.ОсновнойСклад.Получить(); 
		НовыйЧек.Касса = Объект.Касса; 
		НовыйЧек.КассоваяСмена = Объект.КассоваяСмена;
		НовыйЧек.Статус = Перечисления.СтатусыЧекаККМ.Пробит;
		
		СуммаДок = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			НоваяСтр = НовыйЧек.Товары.Добавить();
			
			// Заполняем стандартные реквизиты
			НоваяСтр.Номенклатура = СтрТЧ.Номенклатура;
			НоваяСтр.Количество = СтрТЧ.Количество;
			НоваяСтр.Цена = СтрТЧ.Цена;
			НоваяСтр.Сумма = СтрТЧ.Сумма;
			
			// Важные поля: Налоговая группа и Марка
			НоваяСтр.НалоговаяГруппа = СтрТЧ.Номенклатура.НалоговаяГруппа;
			НоваяСтр.АкцизнаяМарка = СтрТЧ.АкцизнаяМарка;
			
			СуммаДок = СуммаДок + СтрТЧ.Сумма;
		КонецЦикла;
		
		НовыйЧек.СуммаДокумента = СуммаДок;
		
		// Заполняем оплату
		Оплата = НовыйЧек.Оплата.Добавить();
		Оплата.ВидОплаты = ВидОплаты;
		Оплата.Сумма = СуммаДок;
		
		НовыйЧек.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
		
	Исключение
		Сообщить("Ошибка проведения: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ПанельБыстрыхТоваров
// (Оставляем старый код для панели без изменений)

&НаСервере
Процедура ИнициализацияНастроекПанели()
	КоличествоВРяду = 4;
	КоличествоРядов = 6;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияПанели(Элемент = Неопределено)
	Если Элементы.Найти("ГруппаВыборТовара") <> Неопределено Тогда
		// Здесь можно привязать к галочке "ПоказатьПанель"
		// Элементы.ГруппаВыборТовара.Видимость = Истина; 
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппыРядов()
	Для ИндексРяда = 0 По КоличествоРядов - 1 Цикл
		ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
		Если Элементы.Найти(ИмяГруппы) = Неопределено Тогда
			ГруппаРяда = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаВыборТовара);
			ГруппаРяда.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяда.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаРяда.Отображение = ОтображениеОбычнойГруппы.Нет;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьГруппыРядов()
	
	// 1. Собираем элементы для удаления
	МассивУдаления = Новый Массив;
	Для Каждого Элемент Из Элементы Цикл
		// Удаляем только динамические кнопки, созданные кодом
		// (Фильтр по префиксу, который мы задавали при создании: "Бтн_" + "CMD_")
		Если СтрНачинаетсяС(Элемент.Имя, "Бтн_CMD_") Тогда
			МассивУдаления.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	// 2. Удаляем
	Для Каждого Эл Из МассивУдаления Цикл
		
		ИмяКоманды = Эл.ИмяКоманды;
		
		// ВАЖНО: Сначала удаляем Элемент формы (Кнопку)
		Попытка
			Элементы.Удалить(Эл);
		Исключение
			// Если элемент уже удален или недоступен
		КонецПопытки;
		
		// ВАЖНО: Только потом удаляем связанную Команду
		Если ЗначениеЗаполнено(ИмяКоманды) Тогда
			Попытка
				Команды.Удалить(Команды[ИмяКоманды]); 
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикУправлениеПанелиТоваров(Действие)
	Перерисовать = Ложь;
	Если Действие = "ПриОткрытии" ИЛИ Действие = "Группа" Тогда
		НомерСтраницыПараметр = 1; Перерисовать = Истина;
	ИначеЕсли Действие = "CледущаяСтраница" Тогда
		НомерСтраницыПараметр = НомерСтраницыПараметр + 1; Перерисовать = Истина;
	ИначеЕсли Действие = "ПредыдущаяСтраница" Тогда
		Если НомерСтраницыПараметр > 1 Тогда НомерСтраницыПараметр = НомерСтраницыПараметр - 1; Перерисовать = Истина; КонецЕсли;
	ИначеЕсли Действие = "Назад" Тогда
		Если ЗначениеЗаполнено(ТекущаяГруппа) Тогда
			ТекущаяГруппа = ПолучитьРодителя(ТекущаяГруппа); НомерСтраницыПараметр = 1; Перерисовать = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Перерисовать Тогда ОбновитьОтображениеНоменклатурыНаСервере(); КонецЕсли;
	// НомерСтраницы = НомерСтраницыПараметр; // Обновление счетчика на форме
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителя(Ссылка) Возврат Ссылка.Родитель; КонецФункции

&НаСервере
Процедура ОбновитьОтображениеНоменклатурыНаСервере()
	УдалитьГруппыРядов(); // Упрощенная очистка
	
	КоличествоНаСтраницу = КоличествоВРяду * КоличествоРядов;
	МассивТоваров = ПолучитьТоварыДляПанели(ТекущаяГруппа, НомерСтраницыПараметр, КоличествоНаСтраницу);
	
	Счетчик = 0;
	Для Каждого СтруктураТовара Из МассивТоваров Цикл
		Счетчик = Счетчик + 1;
		ИндексРяда = Цел((Счетчик - 1) / КоличествоВРяду);
		ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
		ГруппаРодитель = Элементы.Найти(ИмяГруппы);
		
		Если ГруппаРодитель <> Неопределено Тогда
			ЧистыйКод = СтрЗаменить(СтруктураТовара.Код, " ", "");
			ЧистыйКод = СтрЗаменить(ЧистыйКод, "-", "_");
			УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			
			Префикс = ?(СтруктураТовара.ЭтоГруппа, "GRP", "ITM");
			ИмяКоманды = "CMD_" + Префикс + "_" + ЧистыйКод + "_" + УИД;
			ИмяКнопки  = "Бтн_" + ИмяКоманды;
			
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Заголовок = СтруктураТовара.Наименование;
			Команда.Действие  = "НажатиеКнопкиТовара"; 
			
			Кнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
			Кнопка.ИмяКоманды = ИмяКоманды;
			Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Кнопка.Высота = 3; Кнопка.Ширина = 18;
			
			Если СтруктураТовара.ЭтоГруппа Тогда Кнопка.ЦветФона = WebЦвета.СветлоЖелтый; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыДляПанели(Родитель, Страница, РазмерСтраницы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Номенклатура.Код, Номенклатура.Наименование, Номенклатура.ЭтоГруппа
		|ИЗ Справочник.Номенклатура КАК Номенклатура
		|ГДЕ Номенклатура.Родитель = &Родитель AND NOT Номенклатура.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО ЭтоГруппа УБЫВ, Наименование";
	Запрос.УстановитьПараметр("Родитель", ?(ЗначениеЗаполнено(Родитель), Родитель, Справочники.Номенклатура.ПустаяСсылка()));
	
	Результат = Запрос.Выполнить();
	МассивРезультат = Новый Массив;
	Начало = (Страница - 1) * РазмерСтраницы; Конец = Начало + РазмерСтраницы;
	
	Счетчик = 0; Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		If Счетчик >= Начало И Счетчик < Конец Тогда
			МассивРезультат.Добавить(Новый Структура("Код, Наименование, ЭтоГруппа", Выборка.Код, Выборка.Наименование, Выборка.ЭтоГруппа));
		EndIf;
		Счетчик = Счетчик + 1;
		Если Счетчик >= Конец Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат МассивРезультат;
КонецФункции

&НаКлиенте
Процедура НажатиеКнопкиТовара(Команда)
	МассивЧастей = СтрРазделить(Команда.Имя, "_");
	If МассивЧастей.Количество() < 3 Then Return; EndIf;
	
	ТипОбъекта = МассивЧастей[1];
	КодОбъекта = МассивЧастей[2];
	
	Если ТипОбъекта = "GRP" Тогда
		ПерейтиВГруппу(КодОбъекта);
	Иначе
		// Для кнопки панели тоже используем глобальный поиск (имитация сканирования кода)
		ОбработкаШтрихкода(КодОбъекта); 
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаСервере
Процедура ПерейтиВГруппу(КодГруппы)
	НайденаяГруппа = Справочники.Номенклатура.НайтиПоКоду(КодГруппы);
	Если Не НайденаяГруппа.Пустая() Тогда ТекущаяГруппа = НайденаяГруппа; КонецЕсли;
КонецПроцедуры

// Заглушки навигации
&НаКлиенте
Процедура Назад(Команда) ОбработчикУправлениеПанелиТоваров("Назад"); АктивироватьПоиск(); КонецПроцедуры
&НаКлиенте
Процедура CледущаяСтраница(Команда) ОбработчикУправлениеПанелиТоваров("CледущаяСтраница"); АктивироватьПоиск(); КонецПроцедуры
&НаКлиенте
Процедура ПредыдущаяСтраница(Команда) ОбработчикУправлениеПанелиТоваров("ПредыдущаяСтраница"); АктивироватьПоиск(); КонецПроцедуры

#КонецОбласти
